stellarcorp/tvsc/hal/rcc/stm32h7xx_rcc.h
#pragma once

#include <cstddef>
#include <cstdint>
#include <new>

#include "hal/adc/stm32h7xx_adc_register_bank.h"
#include "hal/gpio/gpio.h"
#include "hal/rcc/rcc.h"
#include "hal/register.h"
#include "hal/time/clock.h"

extern "C" {

/**
 * These symbols are usually required by the ARM CMSIS code. They are typically defined in a file
 * named system_<device>.c. We declare them here so that they can be used in our code as well; if
 * we're paying for them, we're using them.
 *
 * It's not clear what is required of these symbols or why they are left to user code to implement
 * and manage. I suspect they were originally intended to be hooks to allow for configurability,
 * like the main() function, but instead, they became requirements of the interface. With that
 * mindset, these functions should be assumed to be the most minimal implementation that makes the
 * CPU work, and all other functionality should be available via other abstractions.
 *
 * The best documentation I can find about these symbols is
 * https://arm-software.github.io/CMSIS_6/latest/Core/group__system__init__gr.html
 *
 * Currently, the implementation being used is from ST Micro.
 */

/*
 * SystemCoreClock is a global variable required by the ARM CMSIS code. It contains the core clock
 * value in ticks per second.
 *
 * For more information, see
 * https://arm-software.github.io/CMSIS_5/Core/html/group__system__init__gr.html#gaa3cd3e43291e81e795d642b79b6088e6
 */
extern uint32_t SystemCoreClock;

/**
 * Function to update the core clock status variable.
 *
 * See
 * https://arm-software.github.io/CMSIS_5/Core/html/group__system__init__gr.html#gae0c36a9591fe6e9c45ecb21a794f0f0f
 * for a bit more information.
 */
void SystemCoreClockUpdate();
}

namespace tvsc::hal::rcc {

class RccRegisterBank final {
 public:
  // Clock source register. This register determines which clocks are in use. It includes flags for
  // turning on the various clocks and PLLs, as well as flags to determine if those clock sources
  // are ready to be used.
  // Offset 0x000
  volatile Register CR;

  std::byte unused1[0x010 - sizeof(Register)];

  // Clock configuration register. This register has several functions. It controls the source of
  // the MCO clock outputs. It controls the prescalers for the timers. It controls which clock is
  // used on a wakeup from system stop. And it controls which clock source is used for the system
  // clock.
  // Offset 0x010
  volatile Register CFGR;

  std::byte unused2[0x04c - 0x10 - sizeof(Register)];

  // Offset 0x04c
  volatile Register D1CCIPR;

  // Offset 0x050
  volatile Register D2CCIP1R;

  // Offset 0x054
  volatile Register D2CCIP2R;

  // Offset 0x058
  volatile Register D3CCIPR;

  std::byte unused3[0x060 - 0x58 - sizeof(Register)];

  // Clock source interrupt enable register. The bits in this register enable/disable the interrupt
  // for the ready signal of the various clock sources.
  // Offset 0x060
  volatile Register CIER;

  std::byte unused4[0x0d4 - 0x60 - sizeof(Register)];

  // Peripheral clock enable registers.

  // Offset 0xd4
  volatile Register AHB3ENR;

  // Offset 0xd8
  volatile Register AHB1ENR;

  // Offset 0xdc
  volatile Register AHB2ENR;

  // Offset 0x0e0
  volatile Register AHB4ENR;

  // Offset 0x0e4
  volatile Register APB3ENR;

  // Offset 0x0e8
  volatile Register APB1LENR;

  // Offset 0x0ec
  volatile Register APB1HENR;

  // Offset 0x0f0
  volatile Register APB2ENR;

  // Offset 0x0f4
  volatile Register APB4ENR;
};

class SysTickRegisterBank final {
 public:
  //
  volatile Register CTRL;
  volatile Register LOAD;
  volatile Register VAL;
  volatile Register CALIB;
};

/**
 * Class to manage the reset and clock circuitry (RCC) on the Nucleo H743ZI board and other boards
 * based on the STM32H7xx series of CPUs.
 */
class RccStm32h7xx final : public Rcc {
 private:
  RccRegisterBank* const rcc_registers_;
  SysTickRegisterBank* const sys_tick_registers_;

  adc::Stm32h7xxAdcRegisterBank* const adc_registers_;

  void update_sys_tick();

 public:
  RccStm32h7xx(void* rcc_base_address, void* sys_tick_base_address, void* adc_base_address)
      : rcc_registers_(new (rcc_base_address) RccRegisterBank),
        sys_tick_registers_(new (sys_tick_base_address) SysTickRegisterBank),
        adc_registers_(new (adc_base_address) adc::Stm32h7xxAdcRegisterBank) {
    // For details on startup procedures, see stm32h7xx_hal_rcc.c. The comments in that file
    // explain many details that are otherwise difficult to find.

    // Also, the code in STM32Cube_FW_H7/Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal.c can be a
    // useful reference.

    // We reinitialize SystemCoreClock as the startup process will have zeroed the BSS, likely
    // including SystemCoreClock. See the startup_<device>.s file for details on this process.
    SystemCoreClockUpdate();

    update_sys_tick();
  }

  void enable_gpio_port_clock(gpio::Port port) override;
  void disable_gpio_port_clock(gpio::Port port) override;

  void enable_adc_clock() override;
  void disable_adc_clock() override;

  void enable_dac_clock() override;
  void disable_dac_clock() override;

  void enable_dma_clock() override;
  void disable_dma_clock() override;

  void set_clock_to_max_speed() override;
  void set_clock_to_min_speed() override;
};

}  // namespace tvsc::hal::rcc
